app/controllers/posts_controller.rb

	def update
		@post = Post.find(params[:id])
		@post.update(
			title: params[:title],
			description: params[:description],
		)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "test post_updated"], ["description", "content has been updated."], ["updated_at", "2017-12-18 19:24:26.682405"], ["id", 3]]